tuning_wdr/log/benchmark_log/1697102637.log
[2023-10-12 17:24:00,335:stress_testing_tool.py#L68:INFO]: {'wal_buffers': 57338, 'shared_buffers': 926021, 'max_process_memory': 59644204, 'maintenance_work_mem': 34482976, 'work_mem': 37087908, 'effective_cache_size': 4068769, 'effective_io_concurrency': 380, 'temp_buffers': 5821264, 'vacuum_cost_limit': 2621, 'vacuum_cost_page_dirty': 1976, 'vacuum_cost_page_hit': 8035, 'vacuum_cost_page_miss': 4330, 'backend_flush_after': 151}
[2023-10-12 17:24:06,712:stress_testing_tool.py#L118:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2576
        write:                           0
        other:                           368
        total:                           2944
    transactions:                        184    (31.37 per sec.)
    queries:                             2944   (501.91 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          5.8644s
    total number of events:              184

Latency (ms):
         min:                                   40.08
         avg:                                  944.76
         max:                                 4729.29
         95th percentile:                     2585.31
         sum:                               173835.15

Threads fairness:
    events (avg/stddev):           5.7500/1.64
    execution time (avg/stddev):   5.4323/0.24


[2023-10-12 17:24:09,967:stress_testing_tool.py#L68:INFO]: {'wal_buffers': 53892, 'shared_buffers': 2340938, 'max_process_memory': 54946643, 'maintenance_work_mem': 28104803, 'work_mem': 24757372, 'effective_cache_size': 28508530, 'effective_io_concurrency': 597, 'temp_buffers': 2535945, 'vacuum_cost_limit': 6292, 'vacuum_cost_page_dirty': 9660, 'vacuum_cost_page_hit': 180, 'vacuum_cost_page_miss': 9265, 'backend_flush_after': 219}
[2023-10-12 17:24:16,372:stress_testing_tool.py#L118:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2590
        write:                           0
        other:                           370
        total:                           2960
    transactions:                        185    (31.41 per sec.)
    queries:                             2960   (502.60 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          5.8880s
    total number of events:              185

Latency (ms):
         min:                                    2.22
         avg:                                  950.08
         max:                                 4070.05
         95th percentile:                     2279.14
         sum:                               175765.10

Threads fairness:
    events (avg/stddev):           5.7812/2.10
    execution time (avg/stddev):   5.4927/0.23


[2023-10-12 17:24:19,391:stress_testing_tool.py#L68:INFO]: {'wal_buffers': 4562, 'shared_buffers': 807119, 'max_process_memory': 57644881, 'maintenance_work_mem': 6922800, 'work_mem': 50475831, 'effective_cache_size': 22170580, 'effective_io_concurrency': 232, 'temp_buffers': 8602699, 'vacuum_cost_limit': 1832, 'vacuum_cost_page_dirty': 584, 'vacuum_cost_page_hit': 5582, 'vacuum_cost_page_miss': 1157, 'backend_flush_after': 10}
[2023-10-12 17:24:25,755:stress_testing_tool.py#L118:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2660
        write:                           0
        other:                           380
        total:                           3040
    transactions:                        190    (32.49 per sec.)
    queries:                             3040   (519.77 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          5.8474s
    total number of events:              190

Latency (ms):
         min:                                    4.14
         avg:                                  916.33
         max:                                 3035.72
         95th percentile:                     2279.14
         sum:                               174102.92

Threads fairness:
    events (avg/stddev):           5.9375/1.87
    execution time (avg/stddev):   5.4407/0.22


[2023-10-12 17:24:29,973:stress_testing_tool.py#L68:INFO]: {'wal_buffers': 35587, 'shared_buffers': 1542054, 'max_process_memory': 58922948, 'maintenance_work_mem': 52642912, 'work_mem': 163953, 'effective_cache_size': 15094849, 'effective_io_concurrency': 724, 'temp_buffers': 9199165, 'vacuum_cost_limit': 8397, 'vacuum_cost_page_dirty': 4915, 'vacuum_cost_page_hit': 4104, 'vacuum_cost_page_miss': 528, 'backend_flush_after': 25}
[2023-10-12 17:24:39,176:stress_testing_tool.py#L118:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2772
        write:                           0
        other:                           396
        total:                           3168
    transactions:                        198    (22.84 per sec.)
    queries:                             3168   (365.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          8.6658s
    total number of events:              198

Latency (ms):
         min:                                    2.18
         avg:                                 1071.24
         max:                                 5632.28
         95th percentile:                     2932.60
         sum:                               212105.30

Threads fairness:
    events (avg/stddev):           6.1875/1.88
    execution time (avg/stddev):   6.6283/0.99