tuning_wdr/log/benchmark_log/1697102921.log
[2023-10-12 17:28:52,504:stress_testing_tool.py#L115:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3094
        write:                           0
        other:                           442
        total:                           3536
    transactions:                        221    (27.53 per sec.)
    queries:                             3536   (440.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          8.0255s
    total number of events:              221

Latency (ms):
         min:                                    1.92
         avg:                                  956.23
         max:                                 3826.39
         95th percentile:                     3095.38
         sum:                               211326.95

Threads fairness:
    events (avg/stddev):           6.9062/2.35
    execution time (avg/stddev):   6.6040/0.92


[2023-10-12 17:29:02,493:stress_testing_tool.py#L115:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2884
        write:                           0
        other:                           412
        total:                           3296
    transactions:                        206    (33.10 per sec.)
    queries:                             3296   (529.56 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          6.2227s
    total number of events:              206

Latency (ms):
         min:                                    2.01
         avg:                                  853.05
         max:                                 2927.17
         95th percentile:                     2238.47
         sum:                               175728.68

Threads fairness:
    events (avg/stddev):           6.4375/1.80
    execution time (avg/stddev):   5.4915/0.36


[2023-10-12 17:29:11,595:stress_testing_tool.py#L115:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3178
        write:                           0
        other:                           454
        total:                           3632
    transactions:                        227    (40.21 per sec.)
    queries:                             3632   (643.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          5.6435s
    total number of events:              227

Latency (ms):
         min:                                    2.02
         avg:                                  749.94
         max:                                 3710.55
         95th percentile:                     2198.52
         sum:                               170237.09

Threads fairness:
    events (avg/stddev):           7.0938/2.24
    execution time (avg/stddev):   5.3199/0.20


[2023-10-12 17:29:23,310:stress_testing_tool.py#L115:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3402
        write:                           0
        other:                           486
        total:                           3888
    transactions:                        243    (29.86 per sec.)
    queries:                             3888   (477.81 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          8.1359s
    total number of events:              243

Latency (ms):
         min:                                    2.16
         avg:                                  851.41
         max:                                 4394.36
         95th percentile:                     2632.28
         sum:                               206893.78

Threads fairness:
    events (avg/stddev):           7.5938/2.66
    execution time (avg/stddev):   6.4654/0.82